
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>虚拟地址空间和分页技术 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="OS_7.html" />
    
    
    <link rel="prev" href="OS_5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="OS_1.html">
            
                <a href="OS_1.html">
            
                    
                    编译的过程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="OS_2.html">
            
                <a href="OS_2.html">
            
                    
                    极客操作系统第二讲——跑通HelloOS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="OS_3.html">
            
                <a href="OS_3.html">
            
                    
                    操作系统内核分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="OS_4.html">
            
                <a href="OS_4.html">
            
                    
                    经典操作系统的内核架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="OS_5.html">
            
                <a href="OS_5.html">
            
                    
                    X86CPU的几种模式
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="OS_6.html">
            
                <a href="OS_6.html">
            
                    
                    虚拟地址空间和分页技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="OS_7.html">
            
                <a href="OS_7.html">
            
                    
                    cache与内存
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="OS_8.html">
            
                <a href="OS_8.html">
            
                    
                    锁机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="OS_9.html">
            
                <a href="OS_9.html">
            
                    
                    Linux自旋锁和信号量的实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="OS_10.html">
            
                <a href="OS_10.html">
            
                    
                    尝试搭建操作系统——grub启动
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="OS_11.html">
            
                <a href="OS_11.html">
            
                    
                    二级引导器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="OS_12.html">
            
                <a href="OS_12.html">
            
                    
                    设置工作模式和环境
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >虚拟地址空间和分页技术</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7B2C;6&#x8BB2;">&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7B2C;6&#x8BB2;</h1>
<h3 id="&#x95EE;&#x9898;&#xFF1A;&#x4E3A;&#x5565;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x8005;&#x8981;&#x5F15;&#x5165;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5462;&#xFF1F;">&#x95EE;&#x9898;&#xFF1A;&#x4E3A;&#x5565;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x8005;&#x8981;&#x5F15;&#x5165;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5462;&#xFF1F;</h3>
<h4 id="&#x5F15;&#x5165;&#xFF1A;&#x591A;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;">&#x5F15;&#x5165;&#xFF1A;&#x591A;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;</h4>
<p>&#x5047;&#x5982;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x53EA;&#x8FD0;&#x884C;&#x4E86;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;A&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6B63;&#x597D;&#x53EF;&#x4EE5;&#x7528;<strong>&#x5B9E;&#x6A21;&#x5F0F;</strong>&#x6765;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x5185;&#x5B58;&#x4E2D;&#x53C8;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x9053;&#x7A0B;&#x5E8F;B&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x8FD0;&#x884C;1s&#xFF0C;&#x76F4;&#x5230;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x7ED3;&#x675F;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x4E2D;&#x5C31;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li><p>&#x8C01;&#x6765;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F; A &#x8DDF;&#x7A0B;&#x5E8F; B &#x6CA1;&#x6709;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x51B2;&#x7A81;&#xFF1F;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x7A0B;&#x5E8F; A&#x3001;B &#x5404;&#x81EA;&#x653E;&#x5728;&#x4EC0;&#x4E48;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x7531; A&#x3001;B &#x7A0B;&#x5E8F;&#x534F;&#x5546;&#xFF0C;&#x8FD8;&#x662F;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x51B3;&#x5B9A;&#x3002;&#xFF08;&#x5373;B&#x7684;&#x5F15;&#x5165;&#x4F1A;&#x4E0D;&#x4F1A;&#x8986;&#x76D6;A&#xFF1F;&#xFF09;</p>
</li>
<li><p>&#x600E;&#x6837;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F; A &#x8DDF;&#x7A0B;&#x5E8F; B &#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x8BFB;&#x5199;&#x5404;&#x81EA;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x7528;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x5C31;&#x80FD;&#x89E3;&#x51B3;</p>
</li>
<li>&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x5185;&#x5B58;&#x5BB9;&#x91CF;&#x95EE;&#x9898;&#xFF1F;&#x7A0B;&#x5E8F; A &#x548C;&#x7A0B;&#x5E8F; B&#xFF0C;&#x5728;&#x4E0D;&#x65AD;&#x5F00;&#x53D1;&#x8FED;&#x4EE3;&#x4E2D;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x88C5;&#x4E0D;&#x4E0B;&#x3002;</li>
<li>&#x8FD8;&#x8981;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x6269;&#x5C55;&#x540E;&#x7684;&#x590D;&#x6742;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x53EA;&#x7A0B;&#x5E8F; A&#x3001;B&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x6709;&#x7A0B;&#x5E8F; C&#x3001;D&#x3001;E&#x3001;F&#x3001;G&#x2026;&#x2026;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x516C;&#x53F8;&#x5F00;&#x53D1;&#xFF0C;&#x800C;&#x6BCF;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x5B58;&#x5BB9;&#x91CF;&#x4E0D;&#x540C;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x53C8;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x5185;&#x5B58;&#x65B9;&#x6848;&#x6709;&#x600E;&#x6837;&#x7684;&#x5F71;&#x54CD;&#x5462;&#xFF1F;</li>
</ol>
<p>&#x8981;&#x60F3;&#x5B8C;&#x7F8E;&#x5730;&#x89E3;&#x51B3;&#x4EE5;&#x4E0A;&#x6700;&#x6838;&#x5FC3;&#x7684; 4 &#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x8F83;&#x597D;&#x7684;&#x65B9;&#x6848;&#x662F;&#xFF1A;<strong>&#x8BA9;&#x6240;&#x6709;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x5404;&#x81EA;&#x4EAB;&#x6709;&#x4E00;&#x4E2A;&#x4ECE; 0 &#x5F00;&#x59CB;&#x5230;&#x6700;&#x5927;&#x5730;&#x5740;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x662F;&#x8BE5;&#x7A0B;&#x5E8F;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x5176;&#x5B83;&#x7A0B;&#x5E8F;&#x65E2;&#x770B;&#x4E0D;&#x5230;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x8BE5;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x548C;&#x5176;&#x5B83;&#x7A0B;&#x5E8F;&#x65E0;&#x5173;&#xFF0C;&#x548C;&#x5177;&#x4F53;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x65E0;&#x5173;&#x3002;</strong></p>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x5C31;&#x662F;<strong>&#x865A;&#x62DF;&#x5730;&#x5740;</strong>&#x3002;</p>
<h3 id="&#x865A;&#x62DF;&#x5730;&#x5740;">&#x865A;&#x62DF;&#x5730;&#x5740;</h3>
<p>HelloWorld&#x7684;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x4E2D;&#x5C31;&#x5B58;&#x5728;&#x865A;&#x62DF;&#x5730;&#x5740;</p>
<pre><code class="lang-assembly">00000000000004e8 &lt;_init&gt;:
 4e8:  48 83 ec 08            sub    $0x8,%rsp
 4ec:  48 8b 05 f5 0a 20 00   mov    0x200af5(%rip),%rax        # 200fe8
 &lt;__gmon_start__&gt;
 4f3:  48 85 c0               test   %rax,%rax
 4f6:  74 02                  je     4fa &lt;_init+0x12&gt;
 4f8:  ff d0                  callq  *%rax
 4fa:  48 83 c4 08            add    $0x8,%rsp
 4fe:  c3                     retq
</code></pre>
<p><code>mov</code>&#x540E;&#x9762;&#x7684;0x200af5&#x5C31;&#x662F;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;&#x540C;&#x6837;<code>je     4fa</code>&#x4E5F;&#x662F;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x7684;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;&#x8FD9;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x4E14;&#x72EC;&#x7ACB;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x662F;&#x7531;&#x8C01;&#x4EA7;&#x751F;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x7B54;&#x6848;&#x662F;&#x94FE;&#x63A5;&#x5668;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x7ECF;&#x8FC7;&#x7F16;&#x8BD1;&#x6B65;&#x9AA4;&#x540E;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x94FE;&#x63A5;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x624D;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x94FE;&#x63A5;&#x5668;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x628A;<strong>&#x591A;&#x4E2A;&#x4EE3;&#x7801;&#x6A21;&#x5757;&#x7EC4;&#x88C5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x89E3;&#x51B3;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x5F15;&#x7528;</strong>&#xFF0C;&#x5373;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x95F4;&#x7684;&#x5730;&#x5740;&#x5F15;&#x7528;&#xFF0C;&#x5F62;&#x6210;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x9759;&#x6001;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x89C6;&#x56FE;&#x3002;</p>
<h3 id="&#x7269;&#x7406;&#x5730;&#x5740;">&#x7269;&#x7406;&#x5730;&#x5740;</h3>
<p>&#x867D;&#x7136;&#x865A;&#x62DF;&#x5730;&#x5740;&#x89E3;&#x51B3;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x865A;&#x62DF;&#x5730;&#x5740;&#x53EA;&#x662F;&#x903B;&#x8F91;&#x4E0A;&#x5B58;&#x5728;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x65E0;&#x6CD5;&#x4F5C;&#x7528;&#x4E8E;&#x786C;&#x4EF6;&#x7535;&#x8DEF;&#x7684;&#xFF0C;&#x7A0B;&#x5E8F;&#x88C5;&#x8FDB;&#x5185;&#x5B58;&#x4E2D;&#x60F3;&#x8981;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x548C;&#x5185;&#x5B58;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x53D6;&#x5F97;&#x6307;&#x4EE4;&#x548C;&#x6570;&#x636E;&#x3002;&#x800C;&#x5185;&#x5B58;&#x53EA;&#x8BA4;&#x4E00;&#x79CD;&#x5730;&#x5740;&#xFF0C;&#x90A3;&#x5C31;&#x662F;<strong>&#x7269;&#x7406;&#x5730;&#x5740;</strong>&#x3002;</p>
<h3 id="&#x865A;&#x62DF;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x8F6C;&#x6362;">&#x865A;&#x62DF;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x8F6C;&#x6362;</h3>
<p>&#x865A;&#x62DF;&#x5730;&#x5740;&#x5FC5;&#x987B;&#x8F6C;&#x5316;&#x4E3A;&#x7269;&#x7406;&#x5730;&#x5740;&#x624D;&#x80FD;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x51FD;&#x6570;p=f(v)&#xFF0C;v&#x4E3A;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;p&#x4E3A;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;</p>
<p>&#x7528;&#x8F6F;&#x4EF6;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x592A;&#x4F4E;&#x6548;&#xFF0C;&#x7528;&#x786C;&#x4EF6;&#x5B9E;&#x73B0;&#x6CA1;&#x6709;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x6700;&#x7EC8;&#x5C31;&#x7528;&#x4E86;&#x8F6F;&#x786C;&#x4EF6;&#x7ED3;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x5C31;&#x662F; MMU&#xFF08;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5355;&#x5143;&#xFF09;&#x3002;MMU &#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x8F6F;&#x4EF6;&#x7ED9;&#x51FA;&#x7684;&#x5730;&#x5740;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x6570;&#x636E;&#xFF0C;&#x8FDB;&#x884C;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;MMU&#x5DE5;&#x4F5C;&#x6846;&#x67B6;&#x56FE;<img src="https://static001.geekbang.org/resource/image/d5/99/d582ff647549b8yy986d90e697d33499.jpg" alt="img"></p>
<p>&#x8FD9;&#x91CC;&#x7684;<strong>&#x5730;&#x5740;&#x8F6C;&#x6362;&#x5173;&#x7CFB;&#x8868;</strong>&#x4E5F;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x601D;&#x8003;&#x8FD9;&#x4E2A;&#x5173;&#x7CFB;&#x8868;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4E48;32&#x4F4D;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8868;&#x5C31;&#x8981;&#x6620;&#x5C04;32&#x4F4D;&#xFF08;4GB&#xFF09;&#xFF0C;&#x90A3;&#x4E48;4GB&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5C31;&#x4F1A;&#x628A;&#x7269;&#x7406;&#x7A7A;&#x95F4;&#x5360;&#x6EE1;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E0D;&#x884C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;&#x5206;&#x6BB5;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x957F;&#x6A21;&#x5F0F;&#x548C;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x7684;&#x6BB5;&#x957F;&#x5EA6;&#x662F;&#x4E0D;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x4E0D;&#x884C;&#x3002;</p>
<p>&#x6700;&#x540E;&#x9009;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;<strong>&#x5206;&#x9875;&#x5F0F;</strong>&#xFF1A;</p>
<p>&#x5373;&#x628A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x548C;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x90FD;&#x5206;&#x6210;&#x540C;&#x7B49;&#x5927;&#x5C0F;&#x7684;&#x5757;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x9875;&#xFF0C;&#x6309;&#x7167;&#x865A;&#x62DF;&#x9875;&#x548C;&#x7269;&#x7406;&#x9875;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x3002;&#x6839;&#x636E;&#x8F6F;&#x4EF6;&#x914D;&#x7F6E;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E2A;&#x9875;&#x7684;&#x5927;&#x5C0F;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E3A; 4KB&#x3001;2MB&#x3001;4MB&#x3001;1GB&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x8FDB;&#x5165;&#x4E86;&#x73B0;&#x4EE3;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x6A21;&#x5F0F;&#x2014;&#x2014;&#x5206;&#x9875;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="https://static001.geekbang.org/resource/image/9b/d0/9b19677448ee973c4f3yya6b3af7b4d0.jpg" alt="img"></p>
<h3 id="mmumemory-manage-unit&#x7684;&#x5B9E;&#x73B0;">MMU(Memory Manage Unit)&#x7684;&#x5B9E;&#x73B0;</h3>
<p>MMU &#x5373;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5355;&#x5143;&#xFF0C;&#x662F;&#x7528;<strong>&#x786C;&#x4EF6;</strong>&#x7535;&#x8DEF;&#x903B;&#x8F91;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x5668;&#x4EF6;&#xFF0C;&#x5B83;&#x8D1F;&#x8D23;&#x63A5;&#x53D7;&#x865A;&#x62DF;&#x5730;&#x5740;&#x548C;&#x5730;&#x5740;&#x5173;&#x7CFB;&#x8F6C;&#x6362;&#x8868;&#xFF0C;&#x4EE5;&#x53CA;&#x8F93;&#x51FA;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;</p>
<p>x86 CPU &#x8981;&#x60F3;&#x5F00;&#x542F; MMU&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x5148;&#x5F00;&#x542F;<strong>&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;</strong>&#x6216;&#x8005;<strong>&#x957F;&#x6A21;&#x5F0F;</strong>&#xFF0C;&#x5B9E;&#x6A21;&#x5F0F;&#x4E0B;&#x662F;&#x4E0D;&#x80FD;&#x5F00;&#x542F; MMU &#x7684;&#x3002;</p>
<p><img src="https://static001.geekbang.org/resource/image/b4/88/b41a2bb00e19e662b34a1b7b7c0ae288.jpg" alt="img">&#x4E0A;&#x56FE;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;&#x7ECF;&#x8FC7; CPU &#x7684;&#x5206;&#x6BB5;&#x673A;&#x5236;&#x4EA7;&#x751F;&#x4E86;&#x7EBF;&#x6027;&#x5730;&#x5740;&#xFF0C;&#x5E73;&#x5766;&#x6A21;&#x5F0F;&#x548C;&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x548C;&#x865A;&#x62DF;&#x5730;&#x5740;&#x662F;&#x76F8;&#x7B49;&#x7684;&#x3002;</p>
<p>&#x56E0;&#x4E3A;<strong>&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;</strong>&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5206;&#x6BB5;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5173;&#x95ED;MMU&#xFF0C;&#x628A;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x76F4;&#x63A5;&#x5F53;&#x4F5C;&#x7269;&#x7406;&#x5730;&#x5740;&#x6765;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;<strong>&#x957F;&#x6A21;&#x5F0F;</strong>&#x4E0B;&#xFF0C;&#x56E0;&#x4E3A;&#x5FFD;&#x7565;&#x4E86;&#x6BB5;&#x57FA;&#x5740;&#x548C;&#x6BB5;&#x957F;&#x5EA6;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x5206;&#x6BB5;&#x7684;&#x6548;&#x679C;&#x6D88;&#x5931;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x5FC5;&#x987B;&#x5F97;<strong>&#x5F00;&#x542F;MMU</strong>&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;</p>
<h3 id="mmu-&#x9875;&#x8868;&#xFF08;&#x5730;&#x5740;&#x5173;&#x7CFB;&#x8F6C;&#x6362;&#x8868;&#xFF09;">MMU &#x9875;&#x8868;&#xFF08;&#x5730;&#x5740;&#x5173;&#x7CFB;&#x8F6C;&#x6362;&#x8868;&#xFF09;</h3>
<p>&#x5B83;&#x63CF;&#x8FF0;&#x4E86;<strong>&#x865A;&#x62DF;&#x5730;&#x5740;</strong>&#x5230;<strong>&#x7269;&#x7406;&#x5730;&#x5740;</strong>&#x7684;&#x8F6C;&#x6362;&#x5173;&#x7CFB;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;<strong>&#x865A;&#x62DF;&#x9875;</strong>&#x5230;<strong>&#x7269;&#x7406;&#x9875;</strong>&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x79F0;&#x4E3A;&#x9875;&#x8868;&#x3002;</p>
<p>&#x9875;&#x8868;&#x4E2D;&#x5E76;&#x4E0D;&#x5B58;&#x653E;&#x865A;&#x62DF;&#x5730;&#x5740;&#x548C;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#xFF0C;&#x53EA;&#x5B58;&#x653E;<strong>&#x7269;&#x7406;&#x9875;&#x9762;&#x7684;&#x5730;&#x5740;</strong>&#x3002;MMU &#x4EE5;<strong>&#x865A;&#x62DF;&#x5730;&#x5740;</strong>&#x4E3A;&#x7D22;&#x5F15;&#x53BB;&#x67E5;&#x8868;&#x8FD4;&#x56DE;<strong>&#x7269;&#x7406;&#x9875;&#x9762;&#x5730;&#x5740;</strong>&#xFF0C;&#x800C;&#x4E14;&#x9875;&#x8868;&#x662F;&#x5206;&#x7EA7;&#x7684;&#xFF0C;&#x603B;&#x4F53;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;&#x4E00;&#x4E2A;&#x9876;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#xFF0C;&#x591A;&#x4E2A;&#x4E2D;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#xFF0C;&#x6700;&#x540E;&#x624D;&#x662F;&#x9875;&#x8868;&#xFF0C;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x56FE;&#x5982;&#x4E0B;.<img src="https://static001.geekbang.org/resource/image/2d/yf/2df904c8ba75065e1491138d63820yyf.jpg" alt="img"></p>
<h3 id="&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;">&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;</h3>
<p>&#x9996;&#x5148;&#x6765;&#x770B;&#x770B;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#xFF0C;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E0B;&#x53EA;&#x6709; 32 &#x4F4D;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x6700;&#x591A; 4GB-1 &#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x5E73;&#x5766;&#x6A21;&#x5F0F;&#x4E2D;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x548C;&#x865A;&#x62DF;&#x5730;&#x5740;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;</p>
<p>&#x5206;&#x9875;&#x5927;&#x5C0F;&#xFF08;&#x7C92;&#x5EA6;&#xFF09;&#x7684;&#x4E0D;&#x540C;&#x4F1A;&#x5BFC;&#x81F4;<strong>&#x865A;&#x62DF;&#x5730;&#x5740;&#x4F4D;&#x6BB5;&#x7684;&#x5206;&#x9694;</strong>&#x548C;<strong>&#x9875;&#x76EE;&#x5F55;&#x7684;&#x5C42;&#x7EA7;&#x4E0D;&#x540C;</strong>&#xFF0C;&#x4F46;&#x865A;&#x62DF;&#x9875;&#x548C;&#x7269;&#x7406;&#x9875;&#x7684;&#x5927;&#x5C0F;&#x59CB;&#x7EC8;&#x662F;&#x7B49;&#x540C;&#x7684;&#x3002;</p>
<h3 id="&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x2014;&#x2014;4kb-&#x9875;">&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x2014;&#x2014;4KB &#x9875;</h3>
<p>&#x8BE5;&#x5206;&#x9875;&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;32 &#x4F4D;&#x865A;&#x62DF;&#x5730;&#x5740;&#x88AB;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x4F4D;&#x6BB5;&#xFF1A;<strong>&#x9875;&#x76EE;&#x5F55;&#x7D22;&#x5F15;</strong>&#x3001;<strong>&#x9875;&#x8868;&#x7D22;&#x5F15;</strong>&#x3001;<strong>&#x9875;&#x5185;&#x504F;&#x79FB;</strong>&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B; 1024 &#x4E2A;&#x6761;&#x76EE; &#xFF0C;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x9875;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x9875;&#x8868;&#x4E2D;&#x6709; 1024 &#x4E2A;&#x6761;&#x76EE;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x5C31;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x9875;&#xFF0C;&#x6BCF;&#x4E2A;&#x7269;&#x7406;&#x9875; 4KB&#x3002;&#x8FD9;&#x6B63;&#x597D;&#x662F; 4GB &#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x4E09;&#x4E2A;&#x4F4D;&#x6BB5;&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;<strong>&#x9876;&#x7EA7;&#x9875;&#x76EE;&#x5F55;</strong>&#xFF0C;<strong>&#x7EC8;&#x6781;&#x9875;&#x76EE;&#x5F55;</strong>&#x548C;<strong>&#x9875;&#x8868;</strong>&#x7684;&#x5BFB;&#x5740;&#x3002;<img src="https://static001.geekbang.org/resource/image/00/f8/00b7f1ef4a1c4f6fc9e6b69109ae0bf8.jpg" alt="img"></p>
<p>CR3 &#x5C31;&#x662F; CPU &#x7684;&#x4E00;&#x4E2A; 32 &#x4F4D;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;MMU &#x5C31;&#x662F;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x627E;&#x5230;&#x9875;&#x76EE;&#x5F55;&#x7684;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5F53;&#x524D;&#x5206;&#x9875;&#x6A21;&#x5F0F;&#x4E0B;&#x7684; CR3&#x3001;&#x9875;&#x76EE;&#x5F55;&#x9879;&#x3001;&#x9875;&#x8868;&#x9879;&#x7684;&#x683C;&#x5F0F;&#x3002;</p>
<p><img src="https://static001.geekbang.org/resource/image/36/c9/361c48e1876a412f9ff9f29bf2dbecc9.jpg" alt="img"></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;<strong>&#x9875;&#x76EE;&#x5F55;&#x9879;</strong>&#x3001;<strong>&#x9875;&#x8868;&#x9879;</strong>&#x90FD;&#x662F; 4 &#x5B57;&#x8282; 32 &#x4F4D;&#xFF08;&#x8FD9;&#x91CC;&#x6307;&#x7684;&#x662F;<strong>&#x9875;&#x76EE;&#x5F55;&#x9879;</strong>&#x7684;&#x957F;&#xFF0C;&#xFF09;&#xFF0C;1024&#x9879;&#xFF08;&#x8FD9;&#x91CC;&#x6307;&#x7684;&#x662F;<strong>&#x9875;&#x76EE;&#x5F55;&#x9879;&#x7684;&#x5BBD;&#x5EA6;</strong>&#xFF09;&#xFF0C;&#x4E58;&#x79EF;&#x5C31;&#x662F;4KB&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x7684;&#x5730;&#x5740;&#x59CB;&#x7EC8;&#x662F; 4KB &#x5BF9;&#x9F50;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F4E; 12 &#x4F4D;&#x624D;&#x53EF;&#x4EE5;&#x53E6;&#x4F5C;&#x5B83;&#x7528;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x9875;&#x9762;&#x7684;&#x76F8;&#x5173;&#x5C5E;&#x6027;&#xFF0C;&#x5982;&#x662F;&#x5426;&#x5B58;&#x5728;&#x3001;&#x662F;&#x5426;&#x53EF;&#x8BFB;&#x53EF;&#x5199;&#x3001;&#x662F;&#x7528;&#x6237;&#x9875;&#x8FD8;&#x662F;&#x5185;&#x6838;&#x9875;&#x3001;&#x662F;&#x5426;&#x5DF2;&#x5199;&#x5165;&#x3001;&#x662F;&#x5426;&#x5DF2;&#x8BBF;&#x95EE;&#x7B49;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E0A;&#x56FE;&#x7684;[<strong>&#x9875;&#x76EE;&#x5F55;&#x8868;&#x57FA;&#x5730;&#x5740;</strong>&#x3001;<strong>&#x9875;&#x8868;&#x7269;&#x7406;&#x57FA;&#x5730;&#x5740;</strong>&#x548C;<strong>4KB&#x7269;&#x7406;&#x9875;&#x9762;&#x57FA;&#x5730;&#x5740;</strong>&#x90FD;&#x6709;20&#x4F4D;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E09;&#x4E2A;&#x8868;&#x7684;&#x5927;&#x5C0F;&#x90FD;&#x662F;4KB&#xFF0C;&#x800C;4KB$2^{20}$&#x5C31;&#x662F;$2^{32}$&#xFF0C;32&#x4F4D;&#x5BFB;&#x5740;&#xFF0C;32&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4E0B;&#x9762;&#x7684;4MB&#x5206;&#x9875;&#x7684;4MB&#x7269;&#x7406;&#x9875;&#x9762;&#x57FA;&#x5730;&#x5740;&#x53EA;&#x6709;10&#x4F4D;&#x4E5F;&#x662F;&#x56E0;&#x4E3A;4MB*$2^{10}$&#x5C31;&#x662F;$2^{32}$&#xFF0C;32&#x4F4D;&#x5BFB;&#x5740;&#xFF0C;32&#x4F4D;&#x5BC4;&#x5B58;&#x5668;]</p>
<h3 id="&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x2014;&#x2014;4mb&#x9875;">&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x2014;&#x2014;4MB&#x9875;</h3>
<p>&#x8BE5;&#x5206;&#x9875;&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;32 &#x4F4D;&#x865A;&#x62DF;&#x5730;&#x5740;&#x88AB;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x4F4D;&#x6BB5;&#xFF1A;&#x9875;&#x8868;&#x7D22;&#x5F15;&#x3001;&#x9875;&#x5185;&#x504F;&#x79FB;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B; 1024 &#x4E2A;&#x6761;&#x76EE;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x9875;&#xFF0C;&#x6BCF;&#x4E2A;&#x7269;&#x7406;&#x9875; 4MB&#xFF0C;&#x6B63;&#x597D;&#x4E3A; 4GB &#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;<img src="https://static001.geekbang.org/resource/image/76/52/76932c52a7b6109854f2de72d71bba52.jpg" alt="img"></p>
<p>CR3 &#x8FD8;&#x662F; 32 &#x4F4D;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x4E0D;&#x518D;&#x6307;&#x5411;&#x9876;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x6307;&#x5411;&#x4E00;&#x4E2A; 4KB &#x5927;&#x5C0F;&#x7684;&#x9875;&#x8868;&#xFF0C;&#x8FD9;&#x4E2A;&#x9875;&#x8868;&#x4F9D;&#x7136;&#x8981; 4KB &#x5730;&#x5740;&#x5BF9;&#x9F50;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B; 1024 &#x4E2A;&#x9875;&#x8868;&#x9879;&#xFF0C;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#x56FE;&#x3002;<img src="https://static001.geekbang.org/resource/image/9a/08/9a4afdc60b790c3e2b7e94b0c7fd4208.jpg" alt="img"></p>
<p>&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;4MB &#x5927;&#x5C0F;&#x7684;&#x9875;&#x9762;&#x4E0B;&#xFF0C;&#x9875;&#x8868;&#x9879;&#x8FD8;&#x662F; 4 &#x5B57;&#x8282; 32 &#x4F4D;&#xFF0C;&#x4F46;&#x53EA;&#x9700;&#x8981;&#x7528;&#x9AD8; 10 &#x4F4D;&#x6765;&#x4FDD;&#x5B58;&#x7269;&#x7406;&#x9875;&#x9762;&#x7684;&#x57FA;&#x5730;&#x5740;&#x5C31;&#x53EF;&#x4EE5;&#x3002;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x7269;&#x7406;&#x9875;&#x9762;&#x90FD;&#x662F; 4MB&#xFF0C;&#x6240;&#x4EE5;&#x4F4E; 22 &#x4F4D;&#x59CB;&#x7EC8;&#x4E3A; 0&#xFF0C;&#x4E3A;&#x4E86;&#x517C;&#x5BB9; 4MB &#x9875;&#x8868;&#x9879;&#x4F4E; 8 &#x4F4D;&#x548C; 4KB &#x9875;&#x8868;&#x9879;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x7B2C; 7 &#x4F4D;&#x53D8;&#x6210;&#x4E86; PS &#x4F4D;&#xFF0C;&#x4E14;&#x5FC5;&#x987B;&#x4E3A; 1&#xFF0C;&#x800C; PAT &#x4F4D;&#x79FB;&#x5230;&#x4E86; 12 &#x4F4D;&#x3002;</p>
<h3 id="&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;">&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;</h3>
<p>&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x5927;&#x5C0F;&#x901A;&#x5E38;&#x4E5F;&#x6709;&#x4E24;&#x79CD;&#xFF0C;4KB &#x5927;&#x5C0F;&#x7684;&#x9875;&#x548C; 2MB &#x5927;&#x5C0F;&#x7684;&#x9875;&#x3002;</p>
<h3 id="&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x2014;&#x2014;4kb-&#x9875;">&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x2014;&#x2014;4KB &#x9875;</h3>
<p>&#x8BE5;&#x5206;&#x9875;&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;64 &#x4F4D;&#x865A;&#x62DF;&#x5730;&#x5740;&#x88AB;&#x5206;&#x4E3A; 6 &#x4E2A;&#x4F4D;&#x6BB5;&#xFF0C;&#x5206;&#x522B;&#x662F;&#xFF1A;&#x4FDD;&#x7559;&#x4F4D;&#x6BB5;&#xFF0C;&#x9876;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#x7D22;&#x5F15;&#x3001;&#x9875;&#x76EE;&#x5F55;&#x6307;&#x9488;&#x7D22;&#x5F15;&#x3001;&#x9875;&#x76EE;&#x5F55;&#x7D22;&#x5F15;&#x3001;&#x9875;&#x8868;&#x7D22;&#x5F15;&#x3001;&#x9875;&#x5185;&#x504F;&#x79FB;&#xFF0C;&#x9876;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#x3001;&#x9875;&#x76EE;&#x5F55;&#x6307;&#x9488;&#x3001;&#x9875;&#x76EE;&#x5F55;&#x3001;&#x9875;&#x8868;&#x5404;&#x5360;&#x6709; 4KB &#x5927;&#x5C0F;&#xFF0C;&#x5176;&#x4E2D;&#x5404;&#x6709; 512 &#x4E2A;&#x6761;&#x76EE;&#xFF0C;&#x6BCF;&#x4E2A;&#x6761;&#x76EE; 8 &#x5B57;&#x8282; 64 &#x4F4D;&#x5927;&#x5C0F;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;(512*64 bit = 1024KB)</p>
<p><img src="https://static001.geekbang.org/resource/image/ec/c9/ecdea93c2544cf9c1d84461b602b03c9.jpg" alt="img"></p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x865A;&#x62DF;&#x5730;&#x5740; 48 &#x5230; 63 &#x8FD9; 16 &#x4F4D;&#x662F;&#x6839;&#x636E;&#x7B2C; 47 &#x4F4D;&#x6765;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;47 &#x4F4D;&#x4E3A; 1&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x4E3A; 1&#xFF0C;&#x53CD;&#x4E4B;&#x4E3A; 0&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A; x86 CPU &#x5E76;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x5168; 64 &#x4F4D;&#x7684;&#x5730;&#x5740;&#x603B;&#x7EBF;&#xFF0C;&#x800C;&#x662F;&#x53EA;&#x5B9E;&#x73B0;&#x4E86; 48 &#x4F4D;&#xFF0C;&#x4F46;&#x662F; CPU &#x7684;&#x5BC4;&#x5B58;&#x5668;&#x5374;&#x662F; 64 &#x4F4D;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x79CD;<strong>&#x6700;&#x9AD8;&#x6709;&#x6548;&#x4F4D;&#x586B;&#x5145;</strong>&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x4F7F;&#x540E;&#x9762;&#x6269;&#x5C55; CPU &#x7684;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x53BB;&#x770B;&#x770B;&#x5F53;&#x524D;&#x5206;&#x9875;&#x6A21;&#x5F0F;&#x4E0B;&#x7684; CR3&#x3001;&#x9876;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#x9879;&#x3001;&#x9875;&#x76EE;&#x5F55;&#x6307;&#x9488;&#x9879;&#x3001;&#x9875;&#x76EE;&#x5F55;&#x9879;&#x3001;&#x9875;&#x8868;&#x9879;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x6211;&#x753B;&#x4E86;&#x4E00;&#x5F20;&#x56FE;&#x5E2E;&#x4F60;&#x7406;&#x89E3;&#x3002;<img src="https://static001.geekbang.org/resource/image/e3/55/e342246f5cfa21c5b5173b9e494bdc55.jpg" alt="img"></p>
<p>&#x7531;&#x4E0A;&#x56FE;&#x53EF;&#x77E5;&#xFF0C;&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7684; 4KB &#x5206;&#x9875;&#x4E0B;&#xFF0C;&#x7531;&#x4E00;&#x4E2A;&#x9876;&#x5C42;&#x76EE;&#x5F55;&#x3001;&#x4E8C;&#x7EA7;&#x4E2D;&#x95F4;&#x5C42;&#x76EE;&#x5F55;&#x548C;&#x4E00;&#x5C42;&#x9875;&#x8868;&#x7EC4;&#x6210;&#x4E86; 64 &#x4F4D;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x8FC7;&#x7A0B;&#x3002;&#x9876;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#x9879;&#x6307;&#x5411;&#x9875;&#x76EE;&#x5F55;&#x6307;&#x9488;&#x9875;&#xFF0C;&#x9875;&#x76EE;&#x5F55;&#x6307;&#x9488;&#x9879;&#x6307;&#x5411;&#x9875;&#x76EE;&#x5F55;&#x9875;&#xFF0C;&#x9875;&#x76EE;&#x5F55;&#x9879;&#x6307;&#x5411;&#x9875;&#x8868;&#x9875;&#xFF0C;&#x9875;&#x8868;&#x9879;&#x6307;&#x5411;&#x4E00;&#x4E2A; 4KB &#x5927;&#x5C0F;&#x7684;&#x7269;&#x7406;&#x9875;&#xFF0C;&#x5404;&#x7EA7;&#x9875;&#x76EE;&#x5F55;&#x9879;&#x4E2D;&#x548C;&#x9875;&#x8868;&#x9879;&#x4E2D;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#x5404;&#x79CD;&#x5C5E;&#x6027;&#x4F4D;&#xFF0C;&#x8FD9;&#x5728;&#x56FE;&#x4E2D;&#x5DF2;&#x7ECF;&#x8BF4;&#x660E;&#x3002;&#x5176;&#x4E2D;&#x7684; <strong>XD </strong>&#x4F4D;&#xFF0C;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x4EE3;&#x7801;<strong>&#x9875;&#x9762;&#x662F;&#x5426;&#x80FD;&#x591F;&#x8FD0;&#x884C;</strong>&#x3002;</p>
<h3 id="&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x2014;&#x2014;2mb-&#x9875;">&#x957F;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;&#x5206;&#x9875;&#x2014;&#x2014;2MB &#x9875;</h3>
<p>&#x7406;&#x89E3;&#x540C;&#x4E0A;<img src="https://static001.geekbang.org/resource/image/68/ea/68bf70d8bcae7802e5291140ac1ec6ea.jpg" alt="img"><img src="https://static001.geekbang.org/resource/image/45/0b/457f6965d0f25bf64bfb9ec698ab7e0b.jpg" alt="img"></p>
<h3 id="&#x5F00;&#x542F;mmu">&#x5F00;&#x542F;MMU</h3>
<p>&#x5177;&#x4F53;&#x4EE3;&#x7801;&#x770B;&#x8BFE;&#x7A0B;</p>
<h3 id="mmu-&#x5730;&#x5740;&#x8F6C;&#x6362;&#x5931;&#x8D25;">MMU &#x5730;&#x5740;&#x8F6C;&#x6362;&#x5931;&#x8D25;</h3>
<p>MMU &#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x662F;&#x6839;&#x636E;&#x9875;&#x8868;&#x6570;&#x636E;&#x628A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x6210;&#x7269;&#x7406;&#x5730;&#x5740;&#xFF0C;&#x4F46;&#x6709;&#x6CA1;&#x6709;&#x53EF;&#x80FD;&#x8F6C;&#x6362;&#x5931;&#x8D25;&#xFF1F;&#x7EDD;&#x5BF9;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x9875;&#x8868;&#x9879;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4E3A;&#x7A7A;&#xFF0C;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x4E86;&#x8D85;&#x7EA7;&#x7BA1;&#x7406;&#x8005;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5411;&#x53EA;&#x8BFB;&#x9875;&#x9762;&#x4E2D;&#x5199;&#x5165;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4; MMU &#x5730;&#x5740;&#x8F6C;&#x6362;&#x5931;&#x8D25;&#x3002;</p>
<p>1.MMU &#x505C;&#x6B62;&#x8F6C;&#x6362;&#x5730;&#x5740;&#x3002;</p>
<p>2.MMU &#x628A;&#x8F6C;&#x6362;&#x5931;&#x8D25;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5199;&#x5165; CPU &#x7684; CR2 &#x5BC4;&#x5B58;&#x5668;&#x3002;</p>
<p>3.MMU &#x89E6;&#x53D1; CPU &#x7684; 14 &#x53F7;&#x4E2D;&#x65AD;&#xFF0C;&#x4F7F; CPU &#x505C;&#x6B62;&#x6267;&#x884C;&#x5F53;&#x524D;&#x6307;&#x4EE4;&#x3002;</p>
<p>4.CPU &#x5F00;&#x59CB;&#x6267;&#x884C; 14 &#x53F7;&#x4E2D;&#x65AD;&#x7684;&#x5904;&#x7406;&#x4EE3;&#x7801;&#xFF0C;&#x4EE3;&#x7801;&#x4F1A;&#x68C0;&#x67E5;&#x539F;&#x56E0;&#xFF0C;&#x5904;&#x7406;&#x597D;&#x9875;&#x8868;&#x6570;&#x636E;&#x8FD4;&#x56DE;&#x3002;</p>
<p>5.CPU &#x4E2D;&#x65AD;&#x8FD4;&#x56DE;&#x7EE7;&#x7EED;&#x6267;&#x884C; MMU &#x5730;&#x5740;&#x8F6C;&#x6362;&#x5931;&#x8D25;&#x65F6;&#x7684;&#x6307;&#x4EE4;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="OS_5.html" class="navigation navigation-prev " aria-label="Previous page: X86CPU的几种模式">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="OS_7.html" class="navigation navigation-next " aria-label="Next page: cache与内存">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"虚拟地址空间和分页技术","level":"1.7","depth":1,"next":{"title":"cache与内存","level":"1.8","depth":1,"path":"OS_7.md","ref":"OS_7.md","articles":[]},"previous":{"title":"X86CPU的几种模式","level":"1.6","depth":1,"path":"OS_5.md","ref":"OS_5.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"OS_6.md","mtime":"2022-01-31T04:02:38.875Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-01-31T05:25:51.549Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

