
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Log4Shell的反思 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2022.1.17.html" />
    
    
    <link rel="prev" href="2021.10.13.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="2021.10.11.html">
            
                <a href="2021.10.11.html">
            
                    
                    2021.10.11随手写写
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2021.10.12.html">
            
                <a href="2021.10.12.html">
            
                    
                    三次握手与四次挥手
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2021.10.13.html">
            
                <a href="2021.10.13.html">
            
                    
                    CNN
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="2022.1.10.html">
            
                <a href="2022.1.10.html">
            
                    
                    Log4Shell的反思
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="2022.1.17.html">
            
                <a href="2022.1.17.html">
            
                    
                    浮点标准
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Log4Shell的反思</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="log4shell&#x6F0F;&#x6D1E;&#x53CD;&#x601D;">Log4Shell&#x6F0F;&#x6D1E;&#x53CD;&#x601D;</h1>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x4EBA;&#xFF0C;&#x6211;&#x7ECF;&#x5E38;&#x4F1A;&#x6D4F;&#x89C8;&#x4E00;&#x4E9B;&#x79D1;&#x6280;&#x70ED;&#x70B9;&#xFF0C;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x7535;&#x8111;&#x5C31;&#x88AB;&#x4E00;&#x4E2A;&#x53F7;&#x79F0; <a href="https://new.qq.com/omn/20211212/20211212A09RGG00.html" target="_blank">&#x3010;&#x6838;&#x5F39;&#x7EA7;&#x6F0F;&#x6D1E;&#x3011;</a> &#x7684;log4Shell&#x6F0F;&#x6D1E;&#x5237;&#x5C4F;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x7A76;&#x7ADF;Log4Shell&#x6F0F;&#x6D1E;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x6211;&#x53C2;&#x8003;&#x4E86;&#x7F51;&#x4E0A;&#x5C11;&#x6570;&#x6D3E;&#x7684; <a href="https://sspai.com/post/70394" target="_blank">&#x4E00;&#x7BC7;&#x62A5;&#x9053;</a> &#xFF0C;&#x5199;&#x4E86;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x3002;&#x867D;&#x7136;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5B8C;&#x5168;&#x4E0D;&#x61C2;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x7C7B;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x662F;&#x672C;&#x7740;&#x5904;&#x5904;&#x90FD;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x5199;&#x4E86;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x7528;&#x6765;&#x8BB0;&#x5F55;&#x3002;</p>
<h3 id="log4shell&#x6F0F;&#x6D1E;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;">Log4Shell&#x6F0F;&#x6D1E;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h3>
<p><code>log4Shell</code> &#x6F0F;&#x6D1E;&#x6D89;&#x53CA;&#x5230; <code>log4j</code> &#x5DE5;&#x5177;&#x3002;<code>Log4j</code>&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#x7684; <code>Java</code> &#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5C06;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4FE1;&#x606F;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x8BB0;&#x5F55;&#x5E76;&#x4E0D;&#x6B62;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x8FD8;&#x6D89;&#x53CA;&#x5230;&#x67E5;&#x8BE2;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x6F0F;&#x6D1E;&#x7684;&#x8FD0;&#x4F5C;&#x7684;&#x539F;&#x7406;&#x4E86;&#x3002;</p>
<p><code>Log4j</code>&#x867D;&#x7136;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x6743;&#x9650;&#x53EF;&#x4E0D;&#x5C11;&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x67E5;&#x8BE2;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x4F1A;&#x6709;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x662F;&#x8BBE;&#x8BA1;&#x8005;&#x8003;&#x8651;&#x5230;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<blockquote>
<p>&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x6B21;&#x8BBF;&#x95EE;&#xFF0C;&#x8BBF;&#x95EE;&#x8005;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x5177;&#x4F53;&#x7684;&#x4FE1;&#x606F;&#xFF0C;<code>log4j</code> &#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x8BBF;&#x95EE;&#x8005;&#x4E0D;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x7684;&#x5168;&#x90E8;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x65F6; <code>log4j</code> &#x5C31;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x68C0;&#x7D22;&#x3001;&#x8BA1;&#x7B97;&#x3001;&#x67E5;&#x8BE2;&#x6765;&#x8865;&#x5168;&#x4FE1;&#x606F;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x91CC;&#x5C31;&#x9700;&#x8981;&#x5F15;&#x5165; <code>LDAP</code>&#x548C; <code>JNDI</code> &#x3002;</p>
<p><code>LDAP</code> &#xFF08;&#x8F7B;&#x578B;&#x76EE;&#x5F55;&#x8BBF;&#x95EE;&#x534F;&#x8BAE;&#xFF0C;Lightweight Directory Access Protocol&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x8BB0;&#x5F55;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x7684;&#x534F;&#x8BAE;&#x3002; <code>log4j</code> &#x8BB0;&#x5F55;&#x4FE1;&#x606F;&#x5C31;&#x9700;&#x8981;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#x3002;&#x800C;&#x534F;&#x8BAE;&#x652F;&#x6301; <code>JNDI</code> &#x67E5;&#x8BE2;&#x65B9;&#x5F0F;&#xFF0C;<code>JNDI</code>&#xFF08;Java Naming and Directory Interface&#xFF09;&#x53EF;&#x4EE5;&#x5728;&#x7ED9;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E2D;&#x67E5;&#x627E;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x4E8E;<code>env.put(Context.PROVIDER_URL, &quot;ldap://127.0.0.1:389&quot;);</code> &#x8FD9;&#x6837;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x53BB;&#x67E5;&#x8BE2;&#x91CC;&#x9762;&#x7684;&#x5177;&#x4F53;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5982;&#x679C;&#x5728; <code>log4j</code> &#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#x65F6;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6076;&#x610F;&#x7684;IP&#x5730;&#x5740;&#xFF0C; <code>log4j</code> &#x5728;&#x8865;&#x5168;&#x4FE1;&#x606F;&#x7684;&#x65F6;&#x5019;&#x8BBF;&#x95EE;&#x4E86;&#x8FD9;&#x4E2A;&#x6076;&#x610F;IP&#x3002;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x8FD8;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;IP&#x53EF;&#x4E0D;&#x50CF;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x70B9;&#x5F00;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x90A3;&#x4E48;&#x968F;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;IP&#x662F;&#x4E00;&#x4E2A;&#x75C5;&#x6BD2;&#x7684;&#x4E0B;&#x8F7D;&#x5730;&#x5740;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528; <code>log4j</code> &#x7684;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x4F1A;&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A;&#x75C5;&#x6BD2;&#xFF0C;&#x8FD9;&#x6837;&#x95EE;&#x9898;&#x5C31;&#x5F88;&#x5927;&#x4E86;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8BBF;&#x95EE;IP&#x5730;&#x5740;&#x65F6;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x81EA;&#x5DF1;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x90A3;&#x4E48;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5185;&#x90E8;IP&#x5C31;&#x4F1A;&#x6CC4;&#x9732;&#x51FA;&#x53BB;&#xFF0C;&#x751A;&#x81F3;&#x8BB8;&#x591A;&#x522B;&#x7684;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x4E5F;&#x4F1A;&#x6CC4;&#x9732;&#x51FA;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x8BA9;&#x9ED1;&#x5BA2;&#x6709;&#x673A;&#x53EF;&#x4E58;&#x4E86;&#x3002;</p>
<h3 id="&#x6F0F;&#x6D1E;&#x80CC;&#x540E;&#x7684;&#x601D;&#x8003;">&#x6F0F;&#x6D1E;&#x80CC;&#x540E;&#x7684;&#x601D;&#x8003;</h3>
<p>&#x5728; <a href="https://sspai.com/post/70394" target="_blank">&#x62A5;&#x9053;</a> &#x4E2D;&#x63D0;&#x5230;&#xFF0C; <code>log4j</code> &#x7684;&#x6743;&#x9650;&#x662F;&#x4E0D;&#x662F;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x533A;&#x533A;&#x4E00;&#x4E2A;<strong>&#x8BB0;&#x5F55;&#x5458;</strong>&#x5374;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x672A;&#x7ECF;&#x9274;&#x522B;&#x7684;&#x5916;&#x90E8;&#x5730;&#x5740;&#x3002;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x8BB0;&#x5F55;&#x4E0D;&#x5168;&#xFF0C;&#x5E94;&#x8BE5;&#x4EA4;&#x7ED9;&#x4E13;&#x95E8;&#x7684;&#x7EC4;&#x4EF6;&#x6765;&#x8865;&#x5168;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x64C5;&#x4F5C;&#x4E3B;&#x5F20;&#x3002;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x8FD9;&#x4E2A;&#x9505;&#x5F97;&#x7531;&#x4ED6;&#x80CC;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53CD;&#x8FC7;&#x6765;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x3002; <code>log4j</code> &#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x3002;&#x65E2;&#x7136;&#x662F;&#x5F00;&#x6E90;&#x7684;&#xFF0C;&#x7531;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4F01;&#x4E1A;&#x4F7F;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x51FA;&#x73B0;&#x5982;&#x6B64;&#x4F4E;&#x7EA7;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x7ECF;&#x8FC7;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x624D;&#x88AB;&#x4EBA;&#x53D1;&#x73B0;&#x3002;Log4j &#x6B64;&#x6B21;&#x6F0F;&#x6D1E;&#x4E5F;<strong>&#x8BA9;&#x4EBA;&#x53CD;&#x601D;&#x5F00;&#x6E90;&#x7EF4;&#x62A4;&#x8005;&#x662F;&#x5426;&#x5F97;&#x5230;&#x4E86;&#x5E94;&#x6709;&#x7684;&#x652F;&#x6301;&#x548C;&#x7406;&#x89E3;&#x3002;</strong></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x4E00;&#x4E0B; <code>log4j</code> &#x7EF4;&#x62A4;&#x8005;&#x7684;&#x63A8;&#x6587;&#xFF1A;</p>
<p><img src="https://gitee.com/ccnuktd/pic-bed/raw/master/image-20220111135814778.png" alt="image-20220111135814778"></p>
<p>&#x6709;&#x70B9;&#x5351;&#x5FAE;&#x5BF9;&#x5427;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x8BBD;&#x523A;&#x7684;&#x56FE;&#xFF1A;</p>
<p><img src="https://cdn.sspai.com/2021/12/13/article/e778f726ed119dcb6abb978f568d9067?imageView2/2/w/1120/q/90/interlace/1/ignore-error/1" alt="img" style="zoom:50%;"></p>
<p>&#x501F;&#x7528; <a href="https://sspai.com/post/70394" target="_blank">&#x62A5;&#x9053;</a> &#x4E2D;&#x7684;&#x8BBA;&#x70B9;&#xFF0C;&#x65E2;&#x7136; Log4j &#x7684;&#x4F7F;&#x7528;&#x5982;&#x6B64;&#x5E7F;&#x6CDB;&#x3001;&#x5728;&#x5404;&#x5927;&#x4E3B;&#x6D41;&#x670D;&#x52A1;&#x4E2D;&#x4EFB;&#x52B3;&#x4EFB;&#x6028;&#xFF0C;&#x90A3;&#x4E48;&#x5927;&#x5382;&#x7684;&#x62C5;&#x5F53;&#x548C;&#x98CE;&#x8303;&#x4F55;&#x5728;&#xFF1F;&#x56E0;&#x6B64;&#x6709;&#x89C2;&#x70B9; <a href="https://blog.filippo.io/professional-maintainers/" target="_blank">&#x4E3B;&#x5F20;</a> &#xFF0C;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x516C;&#x53F8;&#x6709;&#x9053;&#x5FB7;&#x4E0A;&#x7684;&#x8D23;&#x4EFB;&#x8D5E;&#x52A9;&#x548C;&#x652F;&#x6301;&#x9879;&#x76EE;&#x7684;&#x7EF4;&#x62A4;&#x8005;&#xFF1B;&#x8FD8;&#x6709;&#x4EBA; <a href="https://news.ycombinator.com/item?id=29524586" target="_blank">&#x63D0;&#x51FA;</a> &#xFF0C;&#x5927;&#x5382;&#x5373;&#x4F7F;&#x4E0D;&#x63D0;&#x4F9B;&#x91D1;&#x94B1;&#x652F;&#x6301;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x81F3;&#x5C11;&#x5E94;&#x8BE5;&#x4E49;&#x52A1;&#x63D0;&#x4F9B;&#x6280;&#x672F;&#x529B;&#x91CF;&#xFF0C;&#x8F85;&#x52A9;&#x6539;&#x8FDB;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x81EA;&#x626B;&#x95E8;&#x524D;&#x96EA;&#xFF0C;&#x4FEE;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x4E86;&#x4E8B;&#xFF1F;</p>
<p>&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x8FC7;&#x6E21;&#x5230;&#x4ECA;&#x5929;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BDD;&#x9898;&#xFF1A;</p>
<h3 id="&#x5982;&#x4F55;&#x770B;&#x5F85;fakerjs&#x5F00;&#x6E90;&#x4F5C;&#x8005;&#x5220;&#x5E93;&#x8DD1;&#x8DEF;&#xFF1F;">&#x5982;&#x4F55;&#x770B;&#x5F85;<em>faker.js</em>&#x5F00;&#x6E90;&#x4F5C;&#x8005;&#x5220;&#x5E93;&#x8DD1;&#x8DEF;&#xFF1F;</h3>
<p>&#x53C2;&#x8003; <a href="https://www.jiqizhixin.com/articles/2022-01-10-2" target="_blank">&#x673A;&#x5668;&#x4E4B;&#x5FC3;&#x7684;&#x62A5;&#x9053;</a>&#xFF0C;1&#x6708;5&#x65E5;Marak&#x5C06;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x7684;faker.js&#x5220;&#x9664;&#x3002;</p>
<p><img src="https://gitee.com/ccnuktd/pic-bed/raw/master/image-20220117171824245.png" alt="image-20220117171824245"></p>
<p>&#x5E76;&#x5411;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x7684;colors.js&#x63D0;&#x4EA4;&#x6076;&#x610F;&#x4EE3;&#x7801;&#xFF0C;&#x5BFC;&#x81F4;&#x5176;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x3002;</p>
<p><img src="https://image.jiqizhixin.com/uploads/editor/1a1be559-22c1-42a8-b2f7-2a6a647631e6/640.png" alt="&#x56FE;&#x7247;"></p>
<p>&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x8BE5;&#x5E93;&#x4F1A;&#x51FA;&#x73B0;&#x5404;&#x79CD;&#x4E71;&#x7801;&#x3002;</p>
<p><img src="https://image.jiqizhixin.com/uploads/editor/11a56b2e-c4b1-492f-a86e-770e0781a8fc/640.png" alt="&#x56FE;&#x7247;"></p>
<p>&#x76EE;&#x524D;&#xFF0C;color.js &#x5DF2;&#x7ECF;&#x66F4;&#x65B0;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x7248;&#x672C;&#x3002;faker.js &#x9879;&#x76EE;&#x5C1A;&#x672A;&#x6062;&#x590D;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x964D;&#x7EA7;&#x5230;&#x6B64;&#x524D;&#x7684; 5.5.3 &#x7248;&#x672C;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F15;&#x7528; <a href="https://developer.51cto.com/art/202201/698535.htm" target="_blank">developer&#x7F51;&#x7684;&#x62A5;&#x9053;</a>&#xFF0C;Marak&#x5728;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x4ED6;&#x6240;&#x5C45;&#x4F4F;&#x7684;&#x7684;&#x516C;&#x5BD3;&#x53D1;&#x751F;&#x706B;&#x707E;&#xFF0C;&#x4ED6;&#x5931;&#x53BB;&#x4E86;&#x5168;&#x90E8;&#x5BB6;&#x5F53;&#x3002;</p>
<p><img src="https://s3.51cto.com/oss/202201/10/d3411c82c038d4edeaa3e834274950ab.jpg?x-oss-process=image/format,jpg" alt="img"></p>
<p>&#x518D;&#x52A0;&#x4E0A;Marak&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6770;&#x51FA;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x65E0;&#x507F;&#x5F00;&#x6E90;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5DF1;&#x5374;&#x8FDE;&#x4E00;&#x4E2A;&#x53EF;&#x89C2;&#x7684;offer&#x90FD;&#x62FF;&#x4E0D;&#x5230;&#xFF0C;&#x5927;&#x516C;&#x53F8;&#x767D;&#x5AD6;&#x4ED6;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5374;&#x4E0D;&#x7ED9;&#x4ED6;&#x517B;&#x6D3B;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x8FD9;&#x7740;&#x5B9E;&#x4EE4;&#x4EBA;&#x550F;&#x5618;&#x3002;&#xFF08;<a href="https://image.jiqizhixin.com/uploads/editor/1c425ef1-d80d-495a-9cfe-2d03dbde9092/640.png" target="_blank">&#x56FE;&#x7247;&#x5F15;&#x7528;</a>&#xFF09;</p>
<p><img src="https://image.jiqizhixin.com/uploads/editor/1c425ef1-d80d-495a-9cfe-2d03dbde9092/640.png" alt="&#x56FE;&#x7247;"></p>
<p>&#x672C;&#x6765;&#x505A;&#x5F00;&#x6E90;&#x662F;&#x4E00;&#x4EF6;&#x65E0;&#x79C1;&#x5949;&#x732E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x5883;&#x9047;&#x672A;&#x514D;&#x4F1A;&#x4F7F;&#x4F5C;&#x8005;&#x5BD2;&#x5FC3;&#x3002;&#x5C31;&#x548C;<code>log4j</code>&#x5DE5;&#x5177;&#x4E00;&#x6837;&#xFF0C;&#x63D0;&#x4F9B;&#x5DE5;&#x5177;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4E0D;&#x4EC5;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x5E94;&#x5F97;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x4E14;&#x53D7;&#x5230;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#x7684;&#x4EBA;&#x4EEC;&#x7684;&#x5927;&#x91CF;&#x6307;&#x8D23;&#x3002;&#x8FD9;&#x4E0D;&#x7981;&#x8BA9;&#x4EBA;&#x6000;&#x7591;&#x8FD8;&#x4F1A;&#x6709;&#x4EBA;&#x518D;&#x53BB;&#x505A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5417;&#xFF1F;</p>
<p>&#x867D;&#x7136;&#x8FD9;&#x4E24;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x4F46;&#x662F;&#x80CC;&#x540E;&#x53CD;&#x5E94;&#x7684;&#x786E;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5982;&#x4F55;&#x8BA9;&#x63D0;&#x4F9B;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x4F5C;&#x8005;&#x4E0D;&#x65E2;&#x6D41;&#x6C57;&#x53C8;&#x53D7;&#x7F6A;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x6BCF;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x8005;&#x9700;&#x8981;&#x601D;&#x8003;&#x7684;&#x95EE;&#x9898;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2021.10.13.html" class="navigation navigation-prev " aria-label="Previous page: CNN">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2022.1.17.html" class="navigation navigation-next " aria-label="Next page: 浮点标准">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Log4Shell的反思","level":"1.5","depth":1,"next":{"title":"浮点标准","level":"1.6","depth":1,"path":"2022.1.17.md","ref":"2022.1.17.md","articles":[]},"previous":{"title":"CNN","level":"1.4","depth":1,"path":"2021.10.13.md","ref":"2021.10.13.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"2022.1.10.md","mtime":"2022-01-17T09:31:29.276Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-01-28T09:20:41.689Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

